# Даны два неупорядоченных набора
# целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания
# все те числа, которые встречаются в обоих наборах.
#
# Пользователь вводит 2 числа.
# n - кол-во элементов первого множества.
# m - кол-во элементов второго множества.
# Затем пользователь вводит сами элементы множеств.

n, m = input().split()
firstNum = [int(a) for a in input().split()]
secondNum = [int(b) for b in input().split()]

print(*sorted(set(firstNum).intersection(secondNum)))